Revit 2027 API
RebarContainerItem.GetCenterlineCurves Method
Overload List
Name | Description
GetCenterlineCurves(Boolean, Boolean, Boolean) |  A chain of curves representing the centerline of the rebar.
GetCenterlineCurves(Boolean, Boolean, Boolean, MultiplanarOption) |  A chain of curves representing the centerline of the rebar.
Top
See Also
Reference
RebarContainerItem Class
Autodesk.Revit.DB.Structure Namespace